Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF8410.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISH" edc:nzwidth="0x8" edc:por="11111111" edc:_addr="0xF99">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="DDRH"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISH0" edc:desc="" edc:mask="0x1" edc:name="TRISH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISH1" edc:desc="" edc:mask="0x1" edc:name="TRISH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISH2" edc:desc="" edc:mask="0x1" edc:name="TRISH2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISH3" edc:desc="" edc:mask="0x1" edc:name="TRISH3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISH4" edc:desc="" edc:mask="0x1" edc:name="TRISH4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISH5" edc:desc="" edc:mask="0x1" edc:name="TRISH5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISH6" edc:desc="" edc:mask="0x1" edc:name="TRISH6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISH7" edc:desc="" edc:mask="0x1" edc:name="TRISH7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RH0" edc:desc="" edc:mask="0x1" edc:name="RH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH1" edc:desc="" edc:mask="0x1" edc:name="RH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH2" edc:desc="" edc:mask="0x1" edc:name="RH2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH3" edc:desc="" edc:mask="0x1" edc:name="RH3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH4" edc:desc="" edc:mask="0x1" edc:name="RH4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH5" edc:desc="" edc:mask="0x1" edc:name="RH5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH6" edc:desc="" edc:mask="0x1" edc:name="RH6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH7" edc:desc="" edc:mask="0x1" edc:name="RH7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISJ" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISJ" edc:nzwidth="0x8" edc:por="11111111" edc:_addr="0xF9A">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="DDRJ"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISJ0" edc:desc="" edc:mask="0x1" edc:name="TRISJ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISJ1" edc:desc="" edc:mask="0x1" edc:name="TRISJ1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISJ2" edc:desc="" edc:mask="0x1" edc:name="TRISJ2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISJ3" edc:desc="" edc:mask="0x1" edc:name="TRISJ3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISJ4" edc:desc="" edc:mask="0x1" edc:name="TRISJ4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISJ5" edc:desc="" edc:mask="0x1" edc:name="TRISJ5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISJ6" edc:desc="" edc:mask="0x1" edc:name="TRISJ6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISJ7" edc:desc="" edc:mask="0x1" edc:name="TRISJ7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RJ0" edc:desc="" edc:mask="0x1" edc:name="RJ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ1" edc:desc="" edc:mask="0x1" edc:name="RJ1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ2" edc:desc="" edc:mask="0x1" edc:name="RJ2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ3" edc:desc="" edc:mask="0x1" edc:name="RJ3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ4" edc:desc="" edc:mask="0x1" edc:name="RJ4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ5" edc:desc="" edc:mask="0x1" edc:name="RJ5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ6" edc:desc="" edc:mask="0x1" edc:name="RJ6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ7" edc:desc="" edc:mask="0x1" edc:name="RJ7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="OSCTUNE" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="OSCTUNE" edc:nzwidth="0x8" edc:por="00-00000" edc:_addr="0xF9B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TUN" edc:desc="" edc:mask="0x1f" edc:name="TUN" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PLLEN" edc:desc="" edc:mask="0x1" edc:name="PLLEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTSRC" edc:desc="" edc:mask="0x1" edc:name="INTSRC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TUN0" edc:desc="" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN1" edc:desc="" edc:mask="0x1" edc:name="TUN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN2" edc:desc="" edc:mask="0x1" edc:name="TUN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN3" edc:desc="" edc:mask="0x1" edc:name="TUN3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN4" edc:desc="" edc:mask="0x1" edc:name="TUN4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
